
[
{
    "id": 6,
    "category": "web aplication",
    "title": "Domain Generator",
    "imageSrc": "projects/domain.png",
    "description": "Web aplication",
    "skills": ["HTML", "CSS", "BootStrap", "Vanilla JS"],
    "demo": "https://crismachuca.github.io/DOMAIN-GENERATOR/",
    "source": "https://github.com/CrisMachuca/DOMAIN-GENERATOR",
    "date": "March 2024",
    "functionality": [
    "Random Domain Generation: Generates random domain names based on user preferences.",
    "Customization Options: Allows users to customize specific segments of their domain names for a personalized touch.",
    "Comprehensive Suggestions: Provides a comprehensive list of all possible domain name combinations.",
    "User-Friendly Interface: Intuitive controls for easy customization and exploration.",
    "Responsive Design: Ensures usability across various devices and screen sizes."
    ],
    "technologies": [
    "Web Development: HTML, CSS, JavaScript",
    "Styling: Bootstrap for modern and responsive design",
    "JavaScript Logic: Vanilla JS for dynamic functionality"
    ],
    "purpose": "The Domain Generator project is a dynamic tool designed to revolutionize the way users explore and create domain names. Developed as part of my learning journey at 4Geeks Academy España, this application blends HTML, Bootstrap, CSS, and JavaScript to offer a seamless and intuitive user experience. It empowers users to customize their domain names, providing endless possibilities and ensuring a perfect fit for their brand, project, or venture. This project highlights my ability to create practical and innovative web applications that meet real-world needs."
  },
  {
    "id": 7,
    "category": "personal project",
    "title": "Rock Paper Scissors",
    "imageSrc": "projects/rockpaper.png",
    "extraImg": ["projects/rock-mobile.png", "projects/rock-mackbook.png"],
    "description": "The addictive game",
    "skills": ["HTML", "CSS", "BootStrap", "Vanilla JS"],
    "demo": "https://crismachuca.github.io/ROCK-PAPER-SCISSORS/",
    "source": "https://github.com/CrisMachuca/ROCK-PAPER-SCISSORS",
    "date": "April 2024",
    "functionality": [
    "Game Mechanics: Implements the classic rock-paper-scissors game with interactive play.",
    "Match Counter: Keeps track of the number of matches played.",
    "End Game Pop-up: Displays a pop-up when the game ends.",
    "Reset Button: Allows users to reset the game and start over.",
    "User Interface: Provides a visually appealing and intuitive interface using Bootstrap."
  ],
    "technologies": [
    "Web Development: HTML, CSS, JavaScript",
    "Styling: Bootstrap for modern and responsive design"
  ],
    "purpose": "The Rock Paper Scissors project is a personal initiative to recreate the classic game with a modern and personal touch. Developed using HTML, CSS, JavaScript, and Bootstrap, this project features an interactive interface, a match counter, and end game notifications. It demonstrates my ability to create engaging and functional web applications, delivering a seamless user experience through client-side technologies and responsive design."

  },
  {
    "id": 8,
    "category": "personal project",
    "title": "Cards Generator",
    "imageSrc": "projects/cardsgenerator.png",
    "description": "A game",
    "skills": ["HTML", "CSS", "Vanilla JS"],
    "demo": "https://crismachuca.github.io/RANDOM-CARDS-GENERATOR/",
    "source": "https://github.com/CrisMachuca/RANDOM-CARDS-GENERATOR",
    "date": "March 2024",
    "functionality": [
      "Random Card Generation: Generates a new random card each time the page is reloaded, every 5 seconds, or when the user clicks a button.",
      "Multiple Card Generation: Allows users to generate multiple random cards at once.",
      "Card Size Adjustment: Users can modify the width and height of the cards through input fields.",
      "User Interface: Provides a visually appealing and intuitive interface using Bootstrap."
    ],
    "technologies": [
      "Web Development: HTML, CSS, JavaScript",
      "Styling: Bootstrap for modern and responsive design"
    ],
    "purpose": "The Cards Generator project is a personal initiative to create a dynamic and interactive random card generator. Developed using HTML, CSS, JavaScript, and Bootstrap, this project features multiple ways to generate random cards, including automatic intervals and user-initiated actions. It also allows for customization of card sizes, showcasing my ability to add complex functionalities and enhance user experience. This project demonstrates my problem-solving skills and my passion for learning and applying new programming concepts."
  
  }
]